app/controllers/api/subscriptions_controller.rb

SELECT  `plans`.* FROM `plans` WHERE `plans`.`id` = 4 LIMIT 1
---
  def convert_currency
  	to = currency_params[:target_currency].upcase
  	@plan = Plan.find(currency_params[:target_plan])

INSERT INTO `subscriptions` (`stripe_card_id`, `stripe_customer_id`, `stripe_charge_id`, `stripe_payment_email`, `user_id`, `plan_id`, `created_at`, `updated_at`) VALUES ('card_15mk7CH4XkuarA8OhHgaxLTO', 'cus_5yhWvPJPbRuXSW', 'ch_15mk7IH4XkuarA8O4rPuMnmt', 'kannanr@7nodes.com', 1, 0, '2015-04-01 11:34:41.028434', '2015-04-01 11:34:41.028434')
---
  def create
  	begin

	  customer = Stripe::Customer.create(
	    :email => stripe_params[:email],
	    :card  => stripe_params[:token],
	    :plan => stripe_params[:stripe_plan]
	  )

	  charge = Stripe::Charge.create(
	    :customer    => customer.id,
	    :amount      => stripe_params[:amount],
	    :description => stripe_params[:desc],
	    :currency    => stripe_params[:currency]
	  )

	  if customer && charge
	  	new_subscription = Subscription.create(stripe_card_id: stripe_params[:card],
						                        stripe_customer_id: customer.id,
						                        stripe_charge_id: charge.id,
						                        stripe_payment_email: stripe_params[:email],
						  		                user_id: current_user.id,
						  		                plan_id: stripe_params[:target_plan].to_i)