app/views/users/_user_list.html.erb

	<tbody id="user_list">
		<% User.all.each do |user| %>
---
SELECT `users`.* FROM `users`