app/controllers/subscriptions_controller.rb

SELECT `plans`.* FROM `plans`
---
	def plans
	  @plans = Plan.all

SELECT  `plans`.* FROM `plans` WHERE `plans`.`id` = 5 LIMIT 1
---
	def upgrade
	  @plan = Plan.find(params[:id])

SELECT  `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`id` = 7 LIMIT 1
---
	def destroy
	  @subscription = Subscription.find(params[:id])

SELECT  `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`id` = 7 LIMIT 1
---
	def reactivate
	  @subscription = Subscription.find(params[:id])

SELECT  `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`id` = 4 LIMIT 1
---
	def deactivate
	  @subscription = Subscription.find(params[:id])

SELECT  `plans`.* FROM `plans` WHERE `plans`.`id` = 4 LIMIT 1
---
	def set_plan
		@plan = Plan.find(params[:id])